py32-rs/py32-data/svd/PY32T020xx.svd
<?xml version="1.0" encoding="utf-8" standalone="no"?>
<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" noNamespaceSchemaLocation="CMSIS-SVD.xsd">
  <vendor>Puya</vendor>
  <vendorID>Puya</vendorID>
  <name>PY32T020xx</name>
  <series>PY32L0</series>
  <version>1.0.0</version>
  <description>Arm 32-bit Cortex-M0+ Microcontroller based device, CPU clock up to 48 MHz.</description>
  <cpu>
    <name>CM0+</name>
    <revision>r0p1</revision>
    <endian>little</endian>
    <mpuPresent>false</mpuPresent>
    <fpuPresent>false</fpuPresent>
    <nvicPrioBits>4</nvicPrioBits>
    <vendorSystickConfig>false</vendorSystickConfig>
  </cpu>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <size>32</size>
  <access>read-write</access>
  <resetValue>0x0</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <peripherals>
    <peripheral>
      <name>ADC</name>
      <description>Analog to Digital Converter</description>
      <baseAddress>0x40012400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ADC_COMP</name>
        <description>ADC and COMP Interrupts</description>
        <value>12</value>
      </interrupt>
      <registers>
        <register>
          <name>ISR</name>
          <description>ADC interrupt and status register</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>EOSMP</name>
              <description>ADC group regular end of sampling flag</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EOC</name>
              <description>ADC group regular end of unitary conversion flag</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EOSEQ</name>
              <description>ADC group regular end of sequence conversions flag</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OVR</name>
              <description>ADC group regular overrun flag</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>AWD</name>
              <description>ADC analog watchdog flag</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <description>ADC interrupt enable register</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>EOSMPIE</name>
              <description>ADC group regular end of sampling interrupt</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EOCIE</name>
              <description>ADC group regular end of unitary conversion interrupt</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EOSEQIE</name>
              <description>ADC group regular end of sequence conversions interrupt</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OVRIE</name>
              <description>ADC group regular overrun interrupt</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>AWDIE</name>
              <description>ADC analog watchdog interrupt</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <description>ADC control register</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>ADEN</name>
              <description>enabl adc</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADDIS</name>
              <description>addis conversion</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADSTART</name>
              <description>start conversion</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ADSTP</name>
              <description>stop conversion</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADCAL</name>
              <description>calibration enable</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR1</name>
          <description>ADC configuration register 1</description>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>SCANDIR</name>
              <description>sequence direction</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RESSEL</name>
              <description>conversion ressel select</description>
              <bitRange>[4:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ALIGN</name>
              <description>align mode</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>EXTSEL</name>
              <description>tigle select</description>
              <bitRange>[8:6]</bitRange>
            </field>
            <field>
              <name>EXTEN</name>
              <description>trigle mode select</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>OVRMOD</name>
              <description>over mode</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CONT</name>
              <description>continul mode</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>WAIT</name>
              <description>wait mode</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>DISCEN</name>
              <description>discent mode</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>AWDSGL</name>
              <description>awd single mode</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>AWDEN</name>
              <description>awd enable</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>AWDCH</name>
              <description>awd channels</description>
              <bitRange>[29:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SMP</name>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>SMP</name>
              <description>sample time</description>
              <bitRange>[2:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TR</name>
          <description>ADC analog watchdog 1 threshold register</description>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>LT</name>
              <description>watch dog values of low</description>
              <bitRange>[11:0]</bitRange>
            </field>
            <field>
              <name>HT</name>
              <description>watch dog values of high</description>
              <bitRange>[27:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CHSEL</name>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>CHSEL0</name>
              <description>Channel-0 selection</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CHSEL1</name>
              <description>Channel-1 selection</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CHSEL2</name>
              <description>Channel-2 selection</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CHSEL3</name>
              <description>Channel-3 selection</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CHSEL4</name>
              <description>Channel-4 selection</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CHSEL5</name>
              <description>Channel-5 selection</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CHSEL6</name>
              <description>Channel-6 selection</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CHSEL7</name>
              <description>Channel-7 selection</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CHSEL8</name>
              <description>Channel-8 selection</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CHSEL9</name>
              <description>Channel-9 selection</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CHSEL10</name>
              <description>Channel-10 selection</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CHSEL11</name>
              <description>Channel-11 selection</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CHSEL12</name>
              <description>Channel-12 selection</description>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DR</name>
          <description>ADC group regular data register</description>
          <addressOffset>0x40</addressOffset>
          <fields>
            <field>
              <name>DATA</name>
              <description>conversion data</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCSR</name>
          <description>ADC calibration configuration and status register</description>
          <addressOffset>0x44</addressOffset>
          <fields>
            <field>
              <name>CALSEL</name>
              <description>calibration mode select</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CALSMP</name>
              <description>calibration sample time</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>CALSET</name>
              <description>calibration value of set</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>OFFSUC</name>
              <description>offset line calibration success</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>CAPSUC</name>
              <description>capu calibration success</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>CALON</name>
              <description>calibration status</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CALRR1</name>
          <description>ADC calibration result register 1</description>
          <addressOffset>0x48</addressOffset>
          <fields>
            <field>
              <name>CALC8OUT</name>
              <description>CALC8OUT</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CALC9OUT</name>
              <description>CALC9OUT</description>
              <bitRange>[15:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CALC10OUT</name>
              <description>CALC10OUT</description>
              <bitRange>[23:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CALC11OUT</name>
              <description>CALC11OUT</description>
              <bitRange>[31:24]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CALRR2</name>
          <description>ADC calibration result register 2</description>
          <addressOffset>0x4C</addressOffset>
          <fields>
            <field>
              <name>CALC4OUT</name>
              <description>CALC4OUT</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CALC5OUT</name>
              <description>CALC5OUT</description>
              <bitRange>[15:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CALC6OUT</name>
              <description>CALC6OUT</description>
              <bitRange>[23:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CALC7OUT</name>
              <description>CALC7OUT</description>
              <bitRange>[31:24]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CALRR3</name>
          <description>ADC calibration result register 3</description>
          <addressOffset>0x50</addressOffset>
          <fields>
            <field>
              <name>CALBOUT</name>
              <description>CALBOUT</description>
              <bitRange>[11:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CALC2OUT</name>
              <description>CALC2OUT</description>
              <bitRange>[20:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CALC3OUT</name>
              <description>CALC3OUT</description>
              <bitRange>[28:24]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CALFIR1</name>
          <description>ADC calibration factor input register 1</description>
          <addressOffset>0x54</addressOffset>
          <fields>
            <field>
              <name>CALC8IO</name>
              <description>CALC8IO</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>CALC9IO</name>
              <description>CALC9IO</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>CALC10IO</name>
              <description>CALC10IO</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>CALC11IO</name>
              <description>CALC11IO</description>
              <bitRange>[31:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CALFIR2</name>
          <description>ADC calibration factor input register 2</description>
          <addressOffset>0x58</addressOffset>
          <fields>
            <field>
              <name>CALC4IO</name>
              <description>CALC4IO</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>CALC5IO</name>
              <description>CALC5IO</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>CALC6IO</name>
              <description>CALC6IO</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>CALC7IO</name>
              <description>CALC7IO</description>
              <bitRange>[31:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CALFIR3</name>
          <description>ADC calibration factor input register 2</description>
          <addressOffset>0x5C</addressOffset>
          <fields>
            <field>
              <name>CALBIO</name>
              <description>CALBIO</description>
              <bitRange>[11:0]</bitRange>
            </field>
            <field>
              <name>CALC2IO</name>
              <description>CALC2IO</description>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>CALC3IO</name>
              <description>CALC3IO</description>
              <bitRange>[28:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CAL_TEST</name>
          <addressOffset>0x60</addressOffset>
          <fields>
            <field>
              <name>CAL_TEST</name>
              <description>calibration test values</description>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>DEBUG_SEL</name>
              <description>debug mode select output of sigs</description>
              <bitRange>[5:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR</name>
          <description>ADC common configuration register</description>
          <addressOffset>0x308</addressOffset>
          <fields>
            <field>
              <name>VREF_BUFFERE</name>
              <description>VerfBuffer enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>VERFBUFF_SEL</name>
              <description>VREFBUF output voltage select</description>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>VREFEN</name>
              <description>reference voltage enable</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>TSEN</name>
              <description>ts line enable</description>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
