py32-rs/py32-data/svd/PY32T020xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>COMP1</name>
      <description>Comparator 1</description>
      <groupName>COMP</groupName>
      <baseAddress>0x40010200</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ADC_COMP</name>
        <description>ADC and COMP Interrupts</description>
        <value>12</value>
      </interrupt>
      <registers>
        <register>
          <name>CSR</name>
          <description>COMP control and status register</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>COMP1_EN</name>
              <description>COMP1 enable bit</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>INMSEL</name>
              <description>COMP1 negative input select</description>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>INPSEL</name>
              <description>COMP1 positive input select</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>WINMODE</name>
              <description>COMP1 window mode enable</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>POLARITY</name>
              <description>COMP1 output polarity selection</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>PWRMODE</name>
              <description>COMP1 power mode selection</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>COMP_VCDIV</name>
              <description>COMP1, COMP2 partial voltage selection</description>
              <bitRange>[25:20]</bitRange>
            </field>
            <field>
              <name>COMP_VCDIV_EN</name>
              <description>VREFCMP voltage divider enable signal</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>COMP_VCSEL</name>
              <description>VREFCMP reference source selection</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>TIM_EXTI_OUT_SEL</name>
              <description>COMP1 output to TIM/EXTI selection</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>COMP_OUT</name>
              <description>COMP1 output status</description>
              <bitRange>[30:30]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FR</name>
          <description>Comparator Filter register</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>FLTEN1</name>
              <description>Comparator 1 digital filter configuration</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>FLTCNT1</name>
              <description>Comparator 1 sampling filter counter</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>COMP2</name>
      <description>Comparator2</description>
      <groupName>COMP</groupName>
      <baseAddress>0x40010210</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ADC_COMP</name>
        <description>ADC and COMP Interrupt</description>
        <value>12</value>
      </interrupt>
      <registers>
        <register>
          <name>CSR</name>
          <description>COMP control and status register</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>COMP2_EN</name>
              <description>COMP2 enable bit</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>INMSEL</name>
              <description>COMP2 negative input select</description>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>INPSEL</name>
              <description>COMP2 positive input select</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>POLARITY</name>
              <description>COMP2 output polarity selection</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>PWRMODE</name>
              <description>COMP2 power mode selection</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>TIM_EXTI_OUT_SEL</name>
              <description>COMP2 output to TIM/EXTI selection</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>COMP_OUT</name>
              <description>COMP2 output status</description>
              <bitRange>[30:30]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FR</name>
          <description>Comparator Filter register</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>FLTEN2</name>
              <description>Comparator 2 digital filtering configuration</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>FLTCNT2</name>
              <description>Comparator 2 sampling filter counter</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
