py32-rs/py32-data/svd/PY32T020xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CRC</name>
      <description>CRC calculation unit</description>
      <baseAddress>0x40023000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DR</name>
          <description>Data register</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>DR</name>
              <description>Data register bits</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IDR</name>
          <description>Independent Data register</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>IDR</name>
              <description>General-purpose 8-bit data register bits</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <description>Control register</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>RESET</name>
              <description>Reset the CRC module</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>DBGMCU</name>
      <description>Debug support</description>
      <groupName>DBGMCU</groupName>
      <baseAddress>0x40015800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>IDCODE</name>
          <displayName>IDCODE</displayName>
          <description>MCU Device ID Code Register</description>
          <addressOffset>0x0</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>REV_ID</name>
              <description>REV_ID</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <displayName>CR</displayName>
          <description>Debug MCU Configuration Register</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>DBG_SLEEP</name>
              <description>Debug Sleep Mode</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>DBG_STOP</name>
              <description>Debug Stop Mode</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>APB_FZ1</name>
          <displayName>APB_FZ1</displayName>
          <description>APB Freeze Register1</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>DBG_IWDG_STOP</name>
              <description>Debug Independent Wachdog stopped whenCore is halted</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>DBG_I2C1_TIMEOUT</name>
              <description>Debug I2C1 TIMEOUT stopped when Core ishalted</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>DBG_LPTIM_STOP</name>
              <description>Debug LPTIM stopped when Core ishalted</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>APB_FZ2</name>
          <displayName>APB_FZ2</displayName>
          <description>APB Freeze Register2</description>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>DBG_TIMER1_STOP</name>
              <description>Debug Timer 1 stopped when Core ishalted</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>DBG_TIM14_STOP</name>
              <description>Debug TIM 14 stopped whenCore is halted</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>EXTI</name>
      <description>External interrupt/event controller</description>
      <baseAddress>0x40021800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>EXTI0_1</name>
        <description>EXTI Line 0 and 1 Interrupt</description>
        <value>5</value>
      </interrupt>
      <interrupt>
        <name>EXTI2_3</name>
        <description>EXTI Line 2 and 3 Interrupt</description>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>EXTI4_15</name>
        <description>EXTI Line 4 to 15 Interrupt</description>
        <value>7</value>
      </interrupt>
      <registers>
        <register>
          <name>RTSR</name>
          <description>EXTI rising trigger selection register</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>RT0</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RT1</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RT2</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RT3</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RT4</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RT5</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RT6</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RT7</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RT8</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RT9</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RT10</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>RT11</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>RT12</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>RT13</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>RT14</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>RT15</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>RT17</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>RT18</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[18:18]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FTSR</name>
          <description>EXTI falling trigger selection register</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>FT0</name>
              <description>Falling trigger event configuration bit of Configurable Event input</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>FT1</name>
              <description>Falling trigger event configuration bit of Configurable Event input</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>FT2</name>
              <description>Falling trigger event configuration bit of Configurable Event input</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>FT3</name>
              <description>Falling trigger event configuration bit of Configurable Event input</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>FT4</name>
              <description>Falling trigger event configuration bit of Configurable Event input</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>FT5</name>
              <description>Falling trigger event configuration bit of Configurable Event input</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>FT6</name>
              <description>Falling trigger event configuration bit of Configurable Event input</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>FT7</name>
              <description>Falling trigger event configuration bit of Configurable Event input</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>FT8</name>
              <description>Falling trigger event configuration bit of Configurable Event input</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>FT9</name>
              <description>Falling trigger event configuration bit of Configurable Event input</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>FT10</name>
              <description>Falling trigger event configuration bit of Configurable Event input</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>FT11</name>
              <description>Falling trigger event configuration bit of Configurable Event input</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>FT12</name>
              <description>Falling trigger event configuration bit of Configurable Event input</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>FT13</name>
              <description>Falling trigger event configuration bit of Configurable Event input</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FT14</name>
              <description>Falling trigger event configuration bit of Configurable Event input</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>FT15</name>
              <description>Falling trigger event configuration bit of Configurable Event input</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>FT17</name>
              <description>Falling trigger event configuration bit of Configurable Event input</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>FT18</name>
              <description>Falling trigger event configuration bit of Configurable Event input</description>
              <bitRange>[18:18]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SWIER</name>
          <description>EXTI software interrupt event register</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>SWI0</name>
              <description>Configurable exti linex enable of soft trigle</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SWI1</name>
              <description>Configurable exti linex enable of soft trigle</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SWI2</name>
              <description>Configurable exti linex enable of soft trigle</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SWI3</name>
              <description>Configurable exti linex enable of soft trigle</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SWI4</name>
              <description>Configurable exti linex enable of soft trigle</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SWI5</name>
              <description>Configurable exti linex enable of soft trigle</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SWI6</name>
              <description>Configurable exti linex enable of soft trigle</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SWI7</name>
              <description>Configurable exti linex enable of soft trigle</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SWI8</name>
              <description>Configurable exti linex enable of soft trigle</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SWI9</name>
              <description>Configurable exti linex enable of soft trigle</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SWI10</name>
              <description>Configurable exti linex enable of soft trigle</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>SWI11</name>
              <description>Configurable exti linex enable of soft trigle</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SWI12</name>
              <description>Configurable exti linex enable of soft trigle</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SWI13</name>
              <description>Configurable exti linex enable of soft trigle</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SWI14</name>
              <description>Configurable exti linex enable of soft trigle</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SWI15</name>
              <description>Configurable exti linex enable of soft trigle</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>SWI17</name>
              <description>Configurable exti linex enable of soft trigle</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SWI18</name>
              <description>Configurable exti linex enable of soft trigle</description>
              <bitRange>[18:18]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PR</name>
          <description>EXTI pending register</description>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>PR0</name>
              <description>Pending line of exti</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PR1</name>
              <description>Pending line of exti</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PR2</name>
              <description>Pending line of exti</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PR3</name>
              <description>Pending line of exti</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PR4</name>
              <description>Pending line of exti</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PR5</name>
              <description>Pending line of exti</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PR6</name>
              <description>Pending line of exti</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PR7</name>
              <description>Pending line of exti</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PR8</name>
              <description>Pending line of exti</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>PR9</name>
              <description>Pending line of exti</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>PR10</name>
              <description>Pending line of exti</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>PR11</name>
              <description>Pending line of exti</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>PR12</name>
              <description>Pending line of exti</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>PR13</name>
              <description>Pending line of exti</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>PR14</name>
              <description>Pending line of exti</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>PR15</name>
              <description>Pending line of exti</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>PR17</name>
              <description>Pending line of exti</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>PR18</name>
              <description>Pending line of exti</description>
              <bitRange>[18:18]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTICR1</name>
          <addressOffset>0x60</addressOffset>
          <fields>
            <field>
              <name>EXTI0</name>
              <description>GPIO exti line select</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>EXTI1</name>
              <description>GPIO exti line select</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>EXTI2</name>
              <description>GPIO exti line select</description>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>EXTI3</name>
              <description>GPIO exti line select</description>
              <bitRange>[25:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTICR2</name>
          <addressOffset>0x64</addressOffset>
          <fields>
            <field>
              <name>EXTI4</name>
              <description>GPIO exti line select</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>EXTI5</name>
              <description>GPIO exti line select</description>
              <bitRange>[9:8]</bitRange>
            </field>
          </fields>
        </register>
