py32-rs/py32-data/svd/PY32T020xx.svd
        <register>
          <name>BSRR</name>
          <description>GPIO port bit set/reset register</description>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>BS0</name>
              <description>Port x set I/O pin 0</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BS1</name>
              <description>Port x set I/O pin 1</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BS2</name>
              <description>Port x set I/O pin 2</description>
              <bitRange>[2:2]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BS3</name>
              <description>Port x set I/O pin 3</description>
              <bitRange>[3:3]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BS4</name>
              <description>Port x set I/O pin 4</description>
              <bitRange>[4:4]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BS5</name>
              <description>Port x set I/O pin 5</description>
              <bitRange>[5:5]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BS6</name>
              <description>Port x set I/O pin 6</description>
              <bitRange>[6:6]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BS7</name>
              <description>Port x set I/O pin 7</description>
              <bitRange>[7:7]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BS8</name>
              <description>Port x set I/O pin 8</description>
              <bitRange>[8:8]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BS9</name>
              <description>Port x set I/O pin 9</description>
              <bitRange>[9:9]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BS10</name>
              <description>Port x set I/O pin 10</description>
              <bitRange>[10:10]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BS11</name>
              <description>Port x set I/O pin 11</description>
              <bitRange>[11:11]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BS12</name>
              <description>Port x set I/O pin 12</description>
              <bitRange>[12:12]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BS13</name>
              <description>Port x set I/O pin 13</description>
              <bitRange>[13:13]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BS14</name>
              <description>Port x set I/O pin 14</description>
              <bitRange>[14:14]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BS15</name>
              <description>Port x set I/O pin 15</description>
              <bitRange>[15:15]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BR0</name>
              <description>Port x reset I/O pin 0</description>
              <bitRange>[16:16]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BR1</name>
              <description>Port x reset I/O pin 1</description>
              <bitRange>[17:17]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BR2</name>
              <description>Port x reset I/O pin 2</description>
              <bitRange>[18:18]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BR3</name>
              <description>Port x reset I/O pin 3</description>
              <bitRange>[19:19]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BR4</name>
              <description>Port x reset I/O pin 4</description>
              <bitRange>[20:20]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BR5</name>
              <description>Port x reset I/O pin 5</description>
              <bitRange>[21:21]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BR6</name>
              <description>Port x reset I/O pin 6</description>
              <bitRange>[22:22]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BR7</name>
              <description>Port x reset I/O pin 7</description>
              <bitRange>[23:23]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BR8</name>
              <description>Port x reset I/O pin 8</description>
              <bitRange>[24:24]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BR9</name>
              <description>Port x reset I/O pin 9</description>
              <bitRange>[25:25]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BR10</name>
              <description>Port x reset I/O pin 10</description>
              <bitRange>[26:26]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BR11</name>
              <description>Port x reset I/O pin 11</description>
              <bitRange>[27:27]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BR12</name>
              <description>Port x reset I/O pin 12</description>
              <bitRange>[28:28]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BR13</name>
              <description>Port x reset I/O pin 13</description>
              <bitRange>[29:29]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BR14</name>
              <description>Port x reset I/O pin 14</description>
              <bitRange>[30:30]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BR15</name>
              <description>Port x reset I/O pin 15</description>
              <bitRange>[31:31]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCKR</name>
          <description>GPIO port configuration lock register</description>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>LCK0</name>
              <description>Port x lock I/O pin 0</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LCK1</name>
              <description>Port x lock I/O pin 1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LCK2</name>
              <description>Port x lock I/O pin 2</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LCK3</name>
              <description>Port x lock I/O pin 3</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LCK4</name>
              <description>Port x lock I/O pin 4</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LCK5</name>
              <description>Port x lock I/O pin 5</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LCK6</name>
              <description>Port x lock I/O pin 6</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LCK7</name>
              <description>Port x lock I/O pin 7</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LCK8</name>
              <description>Port x lock I/O pin 8</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LCK9</name>
              <description>Port x lock I/O pin 9</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>LCK10</name>
              <description>Port x lock I/O pin 10</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>LCK11</name>
              <description>Port x lock I/O pin 11</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>LCK12</name>
              <description>Port x lock I/O pin 12</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>LCK13</name>
              <description>Port x lock I/O pin 13</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>LCK14</name>
              <description>Port x lock I/O pin 14</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>LCK15</name>
              <description>Port x lock I/O pin 15</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>LCKK</name>
              <description>Lock key</description>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AFRL</name>
          <description>GPIO alternate function low register</description>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>AFSEL0</name>
              <description>Alternate function selection for port x I/O pin 0</description>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>AFSEL1</name>
              <description>Alternate function selection for port x I/O pin 1</description>
              <bitRange>[6:4]</bitRange>
            </field>
            <field>
              <name>AFSEL2</name>
              <description>Alternate function selection for port x I/O pin 2</description>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>AFSEL3</name>
              <description>Alternate function selection for port x I/O pin 4</description>
              <bitRange>[14:12]</bitRange>
            </field>
            <field>
              <name>AFSEL4</name>
              <description>Alternate function selection for port x I/O pin 4</description>
              <bitRange>[18:16]</bitRange>
            </field>
            <field>
              <name>AFSEL5</name>
              <description>Alternate function selection for port x I/O pin 5</description>
              <bitRange>[22:20]</bitRange>
            </field>
            <field>
              <name>AFSEL6</name>
              <description>Alternate function selection for port x I/O pin 6</description>
              <bitRange>[26:24]</bitRange>
            </field>
            <field>
              <name>AFSEL7</name>
              <description>Alternate function selection for port x I/O pin 7</description>
              <bitRange>[30:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AFRH</name>
          <description>GPIO alternate function high register</description>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>AFSEL8</name>
              <description>Alternate function selection for port x I/O pin 8</description>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>AFSEL9</name>
              <description>Alternate function selection for port x I/O pin 9</description>
              <bitRange>[6:4]</bitRange>
            </field>
            <field>
              <name>AFSEL10</name>
              <description>Alternate function selection for port x I/O pin 10</description>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>AFSEL11</name>
              <description>Alternate function selection for port x I/O pin 11</description>
              <bitRange>[14:12]</bitRange>
            </field>
            <field>
              <name>AFSEL12</name>
              <description>Alternate function selection for port x I/O pin 12</description>
              <bitRange>[18:16]</bitRange>
            </field>
            <field>
              <name>AFSEL13</name>
              <description>Alternate function selection for port x I/O pin 13</description>
              <bitRange>[22:20]</bitRange>
            </field>
            <field>
              <name>AFSEL14</name>
              <description>Alternate function selection for port x I/O pin 14</description>
              <bitRange>[26:24]</bitRange>
            </field>
            <field>
              <name>AFSEL15</name>
              <description>Alternate function selection for port x I/O pin 15</description>
              <bitRange>[30:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BRR</name>
          <description>port bit reset register</description>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>BR0</name>
              <description>Port x reset IO pin 0</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>BR1</name>
              <description>Port x reset IO pin 1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>BR2</name>
              <description>Port x reset IO pin 2</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>BR3</name>
              <description>Port x reset IO pin 3</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>BR4</name>
              <description>Port x reset IO pin 4</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>BR5</name>
              <description>Port x reset IO pin 5</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>BR6</name>
              <description>Port x reset IO pin 6</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>BR7</name>
              <description>Port x reset IO pin 7</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>BR8</name>
              <description>Port x reset IO pin 8</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>BR9</name>
              <description>Port x reset IO pin 9</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BR10</name>
              <description>Port x reset IO pin 10</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>BR11</name>
              <description>Port x reset IO pin 11</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>BR12</name>
              <description>Port x reset IO pin 12</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>BR13</name>
              <description>Port x reset IO pin 13</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>BR14</name>
              <description>Port x reset IO pin 14</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>BR15</name>
              <description>Port x reset IO pin 15</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
