py32-rs/py32-data/svd/PY32T020xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PWR</name>
      <description>Power control</description>
      <baseAddress>0x40007000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR1</name>
          <description>Power control register 1</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>DBP</name>
              <description>dbg mode protect enable</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>FLS_SLPTIME</name>
              <description>flash sleep time control</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>LPR</name>
              <description>pmu mode control</description>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>SRAM_RETV_CTRL</name>
              <description>sram retev control</description>
              <bitRange>[18:17]</bitRange>
            </field>
            <field>
              <name>HSION_CTRL</name>
              <description>HSION CTRL</description>
              <bitRange>[19:19]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>RCC</name>
      <description>Reset and clock control</description>
      <baseAddress>0x40021000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>RCC</name>
        <description>RCC global Interrupt</description>
        <value>4</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <description>Clock control register</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>HSION</name>
              <description>HSI clock enable bit</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>HSIRDY</name>
              <description>HSI clock ready logo</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HSIDIV</name>
              <description>HSI generates the crossover factor when HSISYS clocks</description>
              <bitRange>[13:11]</bitRange>
            </field>
            <field>
              <name>HSEON</name>
              <description>HSE crystal oscillator enabled</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>HSERDY</name>
              <description>HSE crystal clock ready flag</description>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HSEBYP</name>
              <description>HSE shields the crystal oscillator and selects the pin input clock</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>HSE_CSSON</name>
              <description>HSE clock security system enabled</description>
              <bitRange>[19:19]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ICSCR</name>
          <description>Internal clock sources calibration register</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>HSI_TRIM</name>
              <description>Clock frequency calibration value</description>
              <bitRange>[12:0]</bitRange>
            </field>
            <field>
              <name>HSI_FS</name>
              <description>HSI frequency selection</description>
              <bitRange>[15:13]</bitRange>
            </field>
            <field>
              <name>LSI_TRIM</name>
              <description>Internal low-speed clock frequency calibration</description>
              <bitRange>[24:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR</name>
          <description>Clock configuration register</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>SW</name>
              <description>System clock source selection</description>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>SWS</name>
              <description>System clock source selection</description>
              <bitRange>[5:3]</bitRange>
            </field>
            <field>
              <name>HPRE</name>
              <description>The AHB clock HCLK is based on the crossover coefficient of SYSCLK</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>PPRE</name>
              <description>APB clock division factor</description>
              <bitRange>[14:12]</bitRange>
            </field>
            <field>
              <name>MCOSEL</name>
              <description>MCO output clock selection</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>MCOPRE</name>
              <description>Microprocessor output clock (MCO) divider factor</description>
              <bitRange>[30:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ECSCR</name>
          <description>External clock source control register</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>HSE_DRV</name>
              <description>HSE drive capability setting</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>HSE_STARTUP</name>
              <description>HSE stabilization time selection</description>
              <bitRange>[4:3]</bitRange>
            </field>
            <field>
              <name>LSE_DRIVER</name>
              <description>LSE drive capability setting</description>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>LSE_STARTUP</name>
              <description>LSE crystal oscillator stabilization time selection</description>
              <bitRange>[21:20]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CIER</name>
          <description>Clock interrupt enable register</description>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>LSIRDYIE</name>
              <description>LSI clock ready interrupt enabled</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LSERDYIE</name>
              <description>LSE clock ready interrupt enabled</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>HSIRDYIE</name>
              <description>HSI clock ready interrupt enabled</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>HSERDYIE</name>
              <description>HSE clock ready interrupt enabled</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CIFR</name>
          <description>Clock interrupt flag register</description>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>LSIRDYF</name>
              <description>LSI clock ready interrupt enabled</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>LSERDYF</name>
              <description>LSE clock ready interrupt enabled</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HSIRDYF</name>
              <description>HSI clock ready interrupt enabled</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HSERDYF</name>
              <description>HSE clock ready interrupt enabled</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CSSF</name>
              <description>HSE Clock Security System (CSS) interrupt flag</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>LSECSSF</name>
              <description>LSE Clock Security System (CSS) interrupt flag</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CICR</name>
          <description>Clock interrupt clear register</description>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>LSIRDYC</name>
              <description>The LSI ready interrupt flag is cleared</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>LSERDYC</name>
              <description>The LSE ready interrupt flag is cleared</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>HSIRDYC</name>
              <description>The HSI ready interrupt flag is cleared to zero</description>
              <bitRange>[3:3]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>HSERDYC</name>
              <description>The HSE ready interrupt flag is cleared to zero</description>
              <bitRange>[4:4]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CSSC</name>
              <description>The HSE Clock Security System (CSS) interrupt flag is cleared to zero</description>
              <bitRange>[8:8]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>LSECSSC</name>
              <description>The LSE Clock Security System (CSS) interrupt flag is cleared</description>
              <bitRange>[9:9]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IOPRSTR</name>
          <description>GPIO reset register</description>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>GPIOARST</name>
              <description>I/O PortA reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GPIOBRST</name>
              <description>I/O PortB reset</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GPIOFRST</name>
              <description>I/O PortF reset</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBRSTR</name>
          <description>AHB peripheral reset register</description>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>CRCRST</name>
              <description>The CRC module is reset</description>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>APBRSTR1</name>
          <description>APB peripheral reset register 1</description>
          <addressOffset>0x2C</addressOffset>
          <fields>
            <field>
              <name>RTCAPBRST</name>
              <description>The RTC module APB is reset</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>UART1RST</name>
              <description>The UART1 module is reset</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>UART2RST</name>
              <description>The UART2 module is reset</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>I2C1RST</name>
              <description>The I2C1 module is reset</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>DBGRST</name>
              <description>The MCU Debug module is reset</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>PWRRST</name>
              <description>The Power interface module is reset.</description>
              <bitRange>[28:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>APBRSTR2</name>
          <description>APB peripheral reset register 2</description>
          <addressOffset>0x30</addressOffset>
          <fields>
            <field>
              <name>SYSCFGRST</name>
              <description>The SYSCFG module is reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TIM1RST</name>
              <description>The TIM1 module is reset</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SPI1RST</name>
              <description>The SPI1 module is reset</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>UART3RST</name>
              <description>The UART3 module is reset</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>TIM14RST</name>
              <description>The TIM14 module is reset</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>ADCRST</name>
              <description>The ADC block is reset</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>COMP1RST</name>
              <description>The COMP1 module is reset</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>COMP2RST</name>
              <description>The COMP2 module is reset</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>TKRST</name>
              <description>TK module reset</description>
              <bitRange>[25:25]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOPENR</name>
          <description>GPIO clock enable register</description>
          <addressOffset>0x34</addressOffset>
          <fields>
            <field>
              <name>GPIOAEN</name>
              <description>I/O PortA clock enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GPIOBEN</name>
              <description>I/O PortB clock enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GPIOFEN</name>
              <description>I/O PortF clock enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBENR</name>
          <description>AHB peripheral clock enable register</description>
          <addressOffset>0x38</addressOffset>
          <fields>
            <field>
              <name>CRCEN</name>
              <description>CRC module clock enabled</description>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>APBENR1</name>
          <description>APB peripheral clock enable register 1</description>
          <addressOffset>0x3C</addressOffset>
          <fields>
            <field>
              <name>RTCAPBEN</name>
              <description>The RTC module APB clock is enabled</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>UART1EN</name>
              <description>The UART1 module clock is enabled</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>UART2EN</name>
              <description>The UART2 module clock is enabled</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>I2C1EN</name>
              <description>I2C1 module clock enable</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>DBGEN</name>
              <description>MCU Debug module clock enable</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>PWREN</name>
              <description>The Power interface module clock enables</description>
              <bitRange>[28:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>APBENR2</name>
          <description>APB peripheral clock enable register 2</description>
          <addressOffset>0x40</addressOffset>
          <fields>
            <field>
              <name>SYSCFGEN</name>
              <description>The SYSCFG module clock is enabled</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TIM1EN</name>
              <description>The TIM1 module clock is enabled</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SPI1EN</name>
              <description>The SPI1 module clock is enabled</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>UART3EN</name>
              <description>The UART3 module clock is enabled</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>TIM14EN</name>
              <description>TIM14 module clock enable</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>ADCEN</name>
              <description>ADC block clock enabled</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>COMP1EN</name>
              <description>COMP1 module clock enable</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>COMP2EN</name>
              <description>COMP2 module clock enabled</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>TKEN</name>
              <description>TK module clock enabled</description>
              <bitRange>[25:25]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCIPR</name>
          <description>Peripherals independent clock configuration register</description>
          <addressOffset>0x54</addressOffset>
          <fields>
            <field>
              <name>TIMCLK_CTRL</name>
              <description>TIMER PCLK FREQUENCY CONTROL</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>COMP1SEL</name>
              <description>COMP1 module clock source selection</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>COMP2SEL</name>
              <description>COMP2 module clock source selection</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>IWDGSEL</name>
              <description>IWDG internal clock source selection</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ADC_CKMODE</name>
              <description>ADC clock mode</description>
              <bitRange>[23:20]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BDCR</name>
          <description>RTC domain control register</description>
          <addressOffset>0x5C</addressOffset>
          <fields>
            <field>
              <name>LSEON</name>
              <description>LSE OSC enabled</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LSERDY</name>
              <description>LSE OSC ready</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LSEBYP</name>
              <description>LSE OSC bypass</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LSECSSON</name>
              <description>LSE CSS enables</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LSECSSD</name>
              <description>LSE CSS (clock security system) detection failed</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RTCSEL</name>
              <description>RTC clock source selection</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>RTC_HSEDIV_SEL</name>
              <description>The RTC clock source is selected as the division of the HSE clock</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>RTCEN</name>
              <description>RTC clock enabled</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>BDRST</name>
              <description>RTC soft reset</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>LSCSEL</name>
              <description>Low-speed clock selection</description>
              <bitRange>[25:25]</bitRange>
            </field>
          </fields>
        </register>
