py32-rs/py32-data/svd/PY32T020xx.svd
        <register>
          <name>CSR</name>
          <description>Control/status register</description>
          <addressOffset>0x60</addressOffset>
          <fields>
            <field>
              <name>LSION</name>
              <description>LSI OSC enabled</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LSIRDY</name>
              <description>LSI OSC stability flag</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PINRST_FLTDIS</name>
              <description>NRST filtering is prohibited</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>BORRSTF</name>
              <description>BOR reset flag</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RMVF</name>
              <description>Clear the reset flag</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>OBLRSTF</name>
              <description>Option byte loader reset flag</description>
              <bitRange>[25:25]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PINRSTF</name>
              <description>External NRST pin reset flag</description>
              <bitRange>[26:26]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PORRSTF</name>
              <description>POR reset flag</description>
              <bitRange>[27:27]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SFTRSTF</name>
              <description>Soft reset flag</description>
              <bitRange>[28:28]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>IWDGRSTF</name>
              <description>IWDG reset flag</description>
              <bitRange>[29:29]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>RTC</name>
      <description>Real time clock</description>
      <baseAddress>0x40002800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>RTC</name>
        <description>RTC Interrupt through EXTI Lines 19</description>
        <value>2</value>
      </interrupt>
      <registers>
        <register>
          <name>CRH</name>
          <description>RTC Control Register High</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>SECIE</name>
              <description>Seconds interrupt allowed bits</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ALRIE</name>
              <description>Alarm interrupt allowed bits</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>OWIE</name>
              <description>Overflow interrupt allow bits</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TK_SECIE</name>
              <description>TK sec interrupt allowable bits</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TK_ALRIE</name>
              <description>TK alarm interrupt allowed bits</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TK_OWIE</name>
              <description>TK overflow interrupt allowable bits</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CRL</name>
          <description>RTC Control Register Low</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>SECF</name>
              <description>Second flag</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ALRF</name>
              <description>Alarm flag</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>OWF</name>
              <description>Overflow flag</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RSF</name>
              <description>Registers synchronized flag</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNF</name>
              <description>Configuration flag</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RTOFF</name>
              <description>RTC operation OFF</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRLH</name>
          <description>RTC Prescaler Load Register High</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>PRL</name>
              <description>RTC prescaler reload value high</description>
              <bitRange>[5:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRLL</name>
          <description>RTC Prescaler Load Register Low</description>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>PRL</name>
              <description>RTC prescaler reload value high</description>
              <bitRange>[15:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIVH</name>
          <description>RTC Prescaler Divider Register High</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>RTC_DIV</name>
              <description>RTC clock divider</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIVL</name>
          <description>RTC Prescaler Divider Register Low</description>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>RTC_DIV</name>
              <description>RTC clock divider</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CNTH</name>
          <description>RTC Counter Register High</description>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>RTC_CNT</name>
              <description>RTC core counter</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNTL</name>
          <description>RTC Counter Register Low</description>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>RTC_CNT</name>
              <description>RTC core counter</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ALRH</name>
          <description>RTC Alarm Register High</description>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>ALR</name>
              <description>RTC alarm value</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ALRL</name>
          <description>RTC Alarm Register Low</description>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>ALR</name>
              <description>RTC alarm value</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BKP_RTCCR</name>
          <addressOffset>0x2C</addressOffset>
          <fields>
            <field>
              <name>CAL</name>
              <description>Calibration value</description>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>CCO</name>
              <description>Calibrate the clock output bits</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ASOE</name>
              <description>Seconds/alarm pulse output enable bit</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ASOS</name>
              <description>Seconds/alarm pulse output select bits</description>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
