py32-rs/py32-data/svd/PY32T020xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SPI1</name>
      <description>Serial peripheral interface</description>
      <groupName>SPI</groupName>
      <baseAddress>0x40013000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SPI1</name>
        <description>SPI1 global Interrupt</description>
        <value>25</value>
      </interrupt>
      <registers>
        <register>
          <name>CR1</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>CPHA</name>
              <description>Clock Phase</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CPOL</name>
              <description>Clock Polarity</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>MSTR</name>
              <description>Master Selection</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>BR</name>
              <description>Baud Rate Control</description>
              <bitRange>[5:3]</bitRange>
            </field>
            <field>
              <name>SPE</name>
              <description>SPI Enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LSBFIRST</name>
              <description>Frame Format</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SSI</name>
              <description>Internal slave select</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SSM</name>
              <description>Software slave management</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RXONLY</name>
              <description>Receive only</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>DFF</name>
              <description>Data frame format</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>BIDIOE</name>
              <description>Output enable in bidirectional mode</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>BIDIMODE</name>
              <description>Bidirectional data mode enable</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>SSOE</name>
              <description>SS Output Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CLRTXFIFO</name>
              <description>Clear FIFO</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ERRIE</name>
              <description>Error Interrupt Enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RXNEIE</name>
              <description>RX buffer Not Empty Interrupt Enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TXEIE</name>
              <description>Tx buffer Empty Interrupt Enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>RXNE</name>
              <description>Receive buffer Not Empty</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TXE</name>
              <description>Transmit buffer Empty</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MODF</name>
              <description>Mode fault</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>OVR</name>
              <description>Overrun flag</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BSY</name>
              <description>Busy flag</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FRLVL</name>
              <description>FIFO Reception Level</description>
              <bitRange>[10:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FTLVL</name>
              <description>FIFO Transmission Level</description>
              <bitRange>[12:11]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR</name>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>DR</name>
              <description>Data Register</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>SYSCFG</name>
      <description>System configuration controller</description>
      <baseAddress>0x40010000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x100</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CFGR1</name>
          <description>SYSCFG configuration register 1</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>MEM_MODE</name>
              <description>Storage Area Mapping Selection</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>TIM1_IC1_SRC</name>
              <description>Timer1 CH1 Input Selection</description>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>ETR_SRC_TIM1</name>
              <description>Timer1 ETR Input Selection</description>
              <bitRange>[9:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR2</name>
          <description>SYSCFG configuration register 2</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>LOCKUP_LOCK</name>
              <description>LOCK_UP as TIM1 Break Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>COMP1_BRK_TIM1</name>
              <description>COMP1 as TIM1 Break Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>COMP2_BRK_TIM1</name>
              <description>COMP2 as TIM1 Break Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>COMP1_OCREF_CLR_TIM1</name>
              <description>COMP1 as TIM1 ocref_clr Enable</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>COMP2_OCREF_CLR_TIM1</name>
              <description>COMP2 as TIM1 ocref_clr Enable</description>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PA_ENS</name>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>PA_ENS</name>
              <description>Pa Noise filter enable</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PB_ENS</name>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>PB_ENS</name>
              <description>Pb Noise filter enable</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PF_ENS</name>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>PF_ENS</name>
              <description>Pf Noise filter enable</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOCFG</name>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>PA_EIIC</name>
              <description>Pa I2C IO enable</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>PF_EIIC</name>
              <description>Pf I2C IO enable</description>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>PF_PU_IIC</name>
              <description>Pf I2C Pull-up resistor control enable</description>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>PA_EHS</name>
              <description>Pa LED IO Conrtol</description>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>PA_IODRVP</name>
              <description>Pa I2C_VCC Output Drive config</description>
              <bitRange>[14:13]</bitRange>
            </field>
            <field>
              <name>PA_ENSEG</name>
              <description>Pa Seg Mode enable</description>
              <bitRange>[21:16]</bitRange>
            </field>
            <field>
              <name>PB_ENSEG</name>
              <description>Pb Seg Mode enable</description>
              <bitRange>[23:22]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PA_ANA2EN</name>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>PA_ANA2EN</name>
              <description>Pa Analog Noise filter enable</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PB_ANA2EN</name>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>PB_ENS</name>
              <description>Pb Analog Noise filter enable</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PF_ANA2EN</name>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>PF_ANA2EN</name>
              <description>Pf Analog Noise filter enable</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PA_IORP</name>
          <addressOffset>0x30</addressOffset>
          <fields>
            <field>
              <name>PA0_IORP</name>
              <description>Pa0 IO pull-up pull-down resistance config</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>PA1_IORP</name>
              <description>Pa1 IO pull-up pull-down resistance config</description>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>PA2_IORP</name>
              <description>Pa2 IO pull-up pull-down resistance config</description>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>PA3_IORP</name>
              <description>Pa3 IO pull-up pull-down resistance config</description>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>PA4_IORP</name>
              <description>Pa4 IO pull-up pull-down resistance config</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>PA5_IORP</name>
              <description>Pa5 IO pull-up pull-down resistance config</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>PA6_IORP</name>
              <description>Pa6 IO pull-up pull-down resistance config</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>PA7_IORP</name>
              <description>Pa7 IO pull-up pull-down resistance config</description>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>PA8_IORP</name>
              <description>Pa8 IO pull-up pull-down resistance config</description>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>PA9_IORP</name>
              <description>Pa9 IO pull-up pull-down resistance config</description>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>PA10_IORP</name>
              <description>Pa10 IO pull-up pull-down resistance config</description>
              <bitRange>[21:20]</bitRange>
            </field>
            <field>
              <name>PA11_IORP</name>
              <description>Pa11 IO pull-up pull-down resistance config</description>
              <bitRange>[23:22]</bitRange>
            </field>
            <field>
              <name>PA12_IORP</name>
              <description>Pa12 IO pull-up pull-down resistance config</description>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>PA13_IORP</name>
              <description>Pa13 IO pull-up pull-down resistance config</description>
              <bitRange>[27:26]</bitRange>
            </field>
            <field>
              <name>PA14_IORP</name>
              <description>Pa14 IO pull-up pull-down resistance config</description>
              <bitRange>[29:28]</bitRange>
            </field>
            <field>
              <name>PA15_IORP</name>
              <description>Pa15 IO pull-up pull-down resistance config</description>
              <bitRange>[31:30]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PB_IORP</name>
          <addressOffset>0x34</addressOffset>
          <fields>
            <field>
              <name>PB0_IORP</name>
              <description>Pb0 IO pull-up pull-down resistance config</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>PB1_IORP</name>
              <description>Pb1 IO pull-up pull-down resistance config</description>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>PB2_IORP</name>
              <description>Pb2 IO pull-up pull-down resistance config</description>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>PB3_IORP</name>
              <description>Pb3 IO pull-up pull-down resistance config</description>
              <bitRange>[7:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PF_IORP</name>
          <addressOffset>0x38</addressOffset>
          <fields>
            <field>
              <name>PF0_IORP</name>
              <description>Pf0 IO pull-up pull-down resistance config</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>PF1_IORP</name>
              <description>Pf1 IO pull-up pull-down resistance config</description>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>PF2_IORP</name>
              <description>Pf2 IO pull-up pull-down resistance config</description>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>PF3_IORP</name>
              <description>Pf3 IO pull-up pull-down resistance config</description>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>PF4_IORP</name>
              <description>Pf4 IO pull-up pull-down resistance config</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>PF5_IORP</name>
              <description>Pf5 IO pull-up pull-down resistance config</description>
              <bitRange>[11:10]</bitRange>
            </field>
          </fields>
        </register>
