py32-rs/py32-data/svd/PY32T020xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TK</name>
      <description>Touch key</description>
      <baseAddress>0x40003800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR1</name>
          <description>Control register 1</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>EN</name>
              <description>TK enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>MODE</name>
              <description>TK mode select</description>
              <bitRange>[2:1]</bitRange>
            </field>
            <field>
              <name>EXTCMODEN</name>
              <description>External CMOD enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ICOPA</name>
              <description>SIDAC source current or sink current select</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>COPAMODE</name>
              <description>Key compensation enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>COPADATA</name>
              <description>unsensed key output control</description>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>VCCTKCR</name>
              <description>VCCTK voltage select</description>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>VCC1CR</name>
              <description>VCC1 voltage select</description>
              <bitRange>[13:11]</bitRange>
            </field>
            <field>
              <name>MIDACSTEP</name>
              <description>MIDAC step select</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SIDACSTEP</name>
              <description>SIDAC step select</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>CFT</name>
              <description>CMP OUT filter select</description>
              <bitRange>[18:16]</bitRange>
            </field>
            <field>
              <name>VCCTKEN</name>
              <description>VCCTK voltage enable</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>INTCMODEN</name>
              <description>Internal CMOD enable</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>CMPHYSEN</name>
              <description>CMP hysteresis enable</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>BUFFEREN</name>
              <description>Discharge buffer enable</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>DIV</name>
              <description>PCLK division(TK_CLK)</description>
              <bitRange>[26:24]</bitRange>
            </field>
            <field>
              <name>STDIV</name>
              <description>PCLK division(ST_CLK)</description>
              <bitRange>[29:27]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <description>Control register 2</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>START</name>
              <description>Sense start</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RSTB</name>
              <description>Counter reset</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SWCTRL</name>
              <description>TK_SW control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CMODCHRG</name>
              <description>CMOD charge enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CMODDISCH</name>
              <description>CMOD discharge enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>MIDACEN</name>
              <description>Main IDAC enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SIDACEN</name>
              <description>Slave IDAC enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CMODVTINIT</name>
              <description>The voltage of CMOD initialization</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PWMM</name>
              <description>PWM mode select</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CTRLSOURCE</name>
              <description>Software or hardware select</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>LPABNORMAL</name>
              <description>Lowpower wake up control</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CSA_DISCH_SEL</name>
              <description>CMOD discharge select in CSA mode</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SHORTSW_NUM</name>
              <description>Short switch times of hardware mode in CSD mode</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>LPEN</name>
              <description>Lowpower wake up enable</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>KVREF</name>
              <description>Reference voltage select</description>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>KVREF_CSA_TARGET</name>
              <description>Vref charging target value in CSA mode</description>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>LFSRW</name>
              <description>LFSR valid bit</description>
              <bitRange>[23:20]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IDACR</name>
          <description>IDAC Control register</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>MIDAC</name>
              <description>Main IDAC configuration</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>SIDAC</name>
              <description>Slave IDAC configuration</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>SIDAC_CSA_TARGET</name>
              <description>SIDAC target value in CSA mode</description>
              <bitRange>[31:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>KR</name>
          <description>Key enable register</description>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>KEN</name>
              <description>Sense function enable</description>
              <bitRange>[25:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR</name>
          <description>Channel Select register</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>CHS</name>
              <description>Sense key select</description>
              <bitRange>[25:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>UCR</name>
          <description>Unsel Control register</description>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>COPAMODEIO</name>
              <description>IO compensation enable</description>
              <bitRange>[25:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STR1</name>
          <description>Stable Time register 1</description>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>SETTIME</name>
              <description>Voltage building time in CSA mode or short switch time in CSD mode or discharge time in PCI mode</description>
              <bitRange>[9:0]</bitRange>
            </field>
            <field>
              <name>VTINITTIME</name>
              <description>CMOD dischsrge time in CSA mode</description>
              <bitRange>[23:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STR2</name>
          <description>Stable Time register 2</description>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>VREF_MIDAC_TIME</name>
              <description>VREF or MIDAC stabilization time in CSA mode</description>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>DISCH_CHRG_TIME</name>
              <description>CMOD discharging or charging time in CSA mode</description>
              <bitRange>[14:8]</bitRange>
            </field>
            <field>
              <name>SIDACTIME</name>
              <description>SIDAC stabilization time in CSA mode</description>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>BEFORE_SW_TIME</name>
              <description>From setting SIDACEN to switching TK_SW time in CSA mode or from clearing CMODDISCH to switching TK_SW time in PCI mode</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>CHRG_SIDACEN_TIME</name>
              <description>From clearing CMODCHRG to setting SIDACEN time in CSA mode</description>
              <bitRange>[29:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>WR</name>
          <description>Window register</description>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>WIN</name>
              <description>Window time</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SDR</name>
          <description>Switch Divide register</description>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>SWDIV</name>
              <description>TK_CLK division(TK_SW)</description>
              <bitRange>[8:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRSR</name>
          <description>Pseudo Random Sequence register</description>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>LFSRP</name>
              <description>LFSR polynomial</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>SEED</name>
              <description>LFSR seed</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DR</name>
          <description>Data register</description>
          <addressOffset>0x2C</addressOffset>
          <fields>
            <field>
              <name>DATA</name>
              <description>Sense data</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>Status register</description>
          <addressOffset>0x30</addressOffset>
          <fields>
            <field>
              <name>SENSEDONE</name>
              <description>Sense finished</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CMPOUT</name>
              <description>CMP output</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SHORTSWERR</name>
              <description>Short switch error of hardware in CSD mode</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <description>Interrupt enable register</description>
          <addressOffset>0x34</addressOffset>
          <fields>
            <field>
              <name>EVTINTEN</name>
              <description>Event interrupt enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ERRINTEN</name>
              <description>Error interrupt enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <description>Interrupt clear register</description>
          <addressOffset>0x38</addressOffset>
          <fields>
            <field>
              <name>EVTINTCLR</name>
              <description>Event interrupt clear</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ERRINTCLR</name>
              <description>Error interrupt clear</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CDR</name>
          <description>Compare Data register</description>
          <addressOffset>0x3C</addressOffset>
          <fields>
            <field>
              <name>CDATA</name>
              <description>Compare data in lowpower</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LPDR</name>
          <description>Lowpower Delta register</description>
          <addressOffset>0x40</addressOffset>
          <fields>
            <field>
              <name>NORMALDELTA</name>
              <description>Delta1</description>
              <bitRange>[9:0]</bitRange>
            </field>
            <field>
              <name>ABNORMALDELTA</name>
              <description>Delta2</description>
              <bitRange>[25:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LPTR</name>
          <description>Lowpower Time register</description>
          <addressOffset>0x44</addressOffset>
          <fields>
            <field>
              <name>LPWAIT</name>
              <description>Wait time in lowpower</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OPR</name>
          <addressOffset>0x48</addressOffset>
          <fields>
            <field>
              <name>OP</name>
              <description>CMP control</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TR</name>
          <addressOffset>0x4C</addressOffset>
          <fields>
            <field>
              <name>TMODE</name>
              <description>Test mode select</description>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>DBGSEL</name>
              <description>Debug signal select</description>
              <bitRange>[19:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DDR</name>
          <addressOffset>0x50</addressOffset>
          <fields>
            <field>
              <name>SHORTSW_DATA</name>
              <description>Short switch data in CSD mode</description>
              <bitRange>[9:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
